// Форматирование в 2ую СС
cout << formatMessage("|{:0b}|",   {-1420})<<"\n"; // |-00000000000000000000010110001100|
cout << formatMessage("|{:0'b}|",  {-1420})<<"\n"; // |-0000'0000'0000'0000'0000'0101'1000'1100|
cout << formatMessage("|{:12b}|",  {-1420})<<"\n"; // |-10110001100|
cout << formatMessage("|{:12'b}|", {-1420})<<"\n"; // |-101'1000'1100|
cout << formatMessage("|{:#0b}|",  {-1420})<<"\n"; // |-0b00000000000000000000010110001100|
cout << formatMessage("|{:~0'b}|", {-1420})<<"\n"; // |1111'1111'1111'1111'1111'1010'0111'0100|
cout << formatMessage("|{:#0'b}|", {-1420})<<"\n"; // |-0b0000'0000'0000'0000'0000'0101'1000'1100|
cout << formatMessage("|{:#12b}|", {-1420})<<"\n"; // |-0b10110001100|
cout << formatMessage("|{:#12'b}|",{-1420})<<"\n"; // |-0b101'1000'1100|

// Фрматирование в 16ую СС
cout << formatMessage("|{:0x}|",        { -1420 }) << "\n"; // |-0000058c|
cout << formatMessage("|{:0X}|",        { -1420 }) << "\n"; // |-0000058C|
cout << formatMessage("|{:0'x}|",       { -1420 }) << "\n"; // |-0000'058c|
cout << formatMessage("|{:12X}|",       { -1420 }) << "\n"; // |-58C        |
cout << formatMessage("|{:#0h}|",       { -1420 }) << "\n"; // |-0000058ch|
cout << formatMessage("|{:#12x}|",      { -1420 }) << "\n"; // |-0x58c      |
cout << formatMessage("|{:!#0X}|",      { -1420 }) << "\n"; // |-0x0000058C|
cout << formatMessage("|{:~!#0X}|",     { -1420 }) << "\n"; // |0xFFFFFA74|
cout << formatMessage("|{:~!#0'X}|",    { -1420 }) << "\n"; // |0xFFFF'FA74|
cout << formatMessage("|{:^12x}|",      { -1420 }) << "\n"; // |    -58c    |
cout << formatMessage("|{:^12X}|",      { -1420 }) << "\n"; // |    -58C    |
cout << formatMessage("|{:^~12X}|",     { -1420 }) << "\n"; // |  FFFFFA74  |
cout << formatMessage("|{:^+~12x}|",    { -1420 }) << "\n"; // | +fffffa74  |

// Форматирование в 10ую СС (по умолчанию спецификатор 'd' можно не указывать)
cout << formatMessage("|{:12}|",        { -1420 }) << "\n"; // |-1420       |
cout << formatMessage("|{:12%}|",       { -1420 }) << "\n"; // |-1420%      |
cout << formatMessage("|{:*=12}|",      { -1420 }) << "\n"; // |-*******1420|
cout << formatMessage("|{:*<12}|",      { -1420 }) << "\n"; // |-1420*******|
cout << formatMessage("|{:*<12'}|",     { -1420 }) << "\n"; // |-1'420******|
cout << formatMessage("|{:*<12'%}|",    { -1420 }) << "\n"; // |-1'420%*****|
cout << formatMessage("|{:>12%}|",      { -1420 }) << "\n"; // |      -1420%|
cout << formatMessage("|{:>12'}|",      { -1420 }) << "\n"; // |      -1'420|
cout << formatMessage("|{:>12'%}|",     { -1420 }) << "\n"; // |     -1'420%|
cout << formatMessage("|{:^12}|",       { -1420 }) << "\n"; // |   -1420    |
cout << formatMessage("|{:^12%}|",      { -1420 }) << "\n"; // |   -1420%   |
cout << formatMessage("|{:^12'}|",      { -1420 }) << "\n"; // |   -1'420   |

// Форматирование по ширине с заполнением fill-символом
// (без ведущего нуля в поле ширины)
cout << formatMessage("|{:=12}|",       { -1420 }) << "\n"; // |-       1420|
cout << formatMessage("|{:=12b}|",      {  1420 }) << "\n"; // | 10110001100|
cout << formatMessage("|{:=12x}|",      { -1420 }) << "\n"; // |-        58c|
cout << formatMessage("|{:=12X}|",      { -1420 }) << "\n"; // |-        58C|
cout << formatMessage("|{:=12%}|",      { -1420 }) << "\n"; // |-      1420%|
cout << formatMessage("|{:*=12}|",      { -1420 }) << "\n"; // |-*******1420|
cout << formatMessage("|{:*=12b}|",     {  1420 }) << "\n"; // |*10110001100|
cout << formatMessage("|{:*=+!#12X}|",  {  1420 }) << "\n"; // |+******0x58C|
cout << formatMessage("|{:= ~!#012X}|", { -1420 }) << "\n"; // | 0x0FFFFFA74|
